Workspace/run/steadyState-noblade-rhoPimpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

saveIter 0.0002;

application     rhoPimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.0292;
deltaT          2e-6;
writeControl    runTime;
writeInterval   $saveIter;
purgeWrite    0;
writeFormat    ascii;
writePrecision  16;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable    true;
adjustTimeStep  no;
maxCo           0.3;
maxDeltaT       1;

functions
{

    #includeFunc mag(U)
    fieldAverage
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

        );
    }
}

// ************************************************************************* //
